In [1]:
!pip install pyspark

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pyspark in c:\users\hi\appdata\roaming\python\python39\site-packages (3.5.0)
Requirement already satisfied: py4j==0.10.9.7 in c:\users\hi\appdata\roaming\python\python39\site-packages (from pyspark) (0.10.9.7)

In [2]:
import pyspark

In [3]:
import pandas as pd

In [7]:
pd.read_csv("C:/Users/HI/OneDrive/Desktop/emp.csv")

   id    name   location  salary  age
0   1  geetha    chennai    2000   20
1   2    rama        hyd    3000   19
2   3   pooja  bangolore    1500   23
3   4     sir        hyd    2500   25

In [8]:
from pyspark.sql import SparkSession

In [9]:
spark=SparkSession.builder.appName('practice').getOrCreate()

In [43]:
spark

reading dataset

In [11]:
df=spark.read.csv("C:/Users/HI/OneDrive/Desktop/emp.csv")

In [12]:
df.show()

+---+------+---------+------+---+
|_c0|   _c1|      _c2|   _c3|_c4|
+---+------+---------+------+---+
| id|  name| location|salary|age|
|  1|geetha|  chennai|  2000| 20|
|  2|  rama|      hyd|  3000| 19|
|  3| pooja|bangolore|  1500| 23|
|  4|   sir|      hyd|  2500| 25|
+---+------+---------+------+---+

In [13]:
df_spark=spark.read.option('header','true').csv("C:/Users/HI/OneDrive/Desktop/emp.csv").show()

+---+------+---------+------+---+
| id|  name| location|salary|age|
+---+------+---------+------+---+
|  1|geetha|  chennai|  2000| 20|
|  2|  rama|      hyd|  3000| 19|
|  3| pooja|bangolore|  1500| 23|
|  4|   sir|      hyd|  2500| 25|
+---+------+---------+------+---+

In [14]:
df_spark=spark.read.option('header','true').csv("C:/Users/HI/OneDrive/Desktop/emp.csv")

In [15]:
type(df_spark)

pyspark.sql.dataframe.DataFrame

In [17]:
df_spark.printSchema()

root
 |-- id: string (nullable = true)
 |-- name: string (nullable = true)
 |-- location: string (nullable = true)
 |-- salary: string (nullable = true)
 |-- age: string (nullable = true)

inferschema=true gives the datatype implicitly .we dont need to specify the datatypes

In [19]:
df_spark=spark.read.option('header','true').csv("C:/Users/HI/OneDrive/Desktop/emp.csv",inferSchema=True)

In [20]:
df_spark.printSchema()

root
 |-- id: integer (nullable = true)
 |-- name: string (nullable = true)
 |-- location: string (nullable = true)
 |-- salary: integer (nullable = true)
 |-- age: integer (nullable = true)

In [21]:
df=spark.read.csv("C:/Users/HI/OneDrive/Desktop/emp.csv",header=True,inferSchema=True)
df.show()

+---+------+---------+------+---+
| id|  name| location|salary|age|
+---+------+---------+------+---+
|  1|geetha|  chennai|  2000| 20|
|  2|  rama|      hyd|  3000| 19|
|  3| pooja|bangolore|  1500| 23|
|  4|   sir|      hyd|  2500| 25|
+---+------+---------+------+---+

In [22]:
type(df)

pyspark.sql.dataframe.DataFrame

In [92]:
df.take(

5

In [94]:
df.dtypes#Return df column names and data types
df.show()#returns dataframe
df.head()#Display the content of df
df.first()# Return the first row
df.take(2)# Return the first n rows
df.describe().show()#Compute summary statistics
df.columns#Return the columns of df
df.count()#Count the number of rows
df.distinct().count()#count the number of distinct rows
df.printSchema()#print schema of df
df.explain()#print logical and physical plans
df = df.dropDuplicates() #removes the duplicate d
df.schema#Return the schema of df

[Row(id=3, name='pooja', location='bangolore', salary=1500, age=23),
 Row(id=4, name='sir', location='hyd', salary=2500, age=25)]

In [ ]:
df.schema#Return the schema of df

In [ ]:
df.describe().show()#Compute summary statistics
df.columns#Return the columns of df
df.count()#Count the number of rows
df.distinct().count()#count the number of distinct rows
df.printSchema()#print schema of df
df.explain()#print logical and physical plans
df = df.dropDuplicates() #removes the duplicate d

In [24]:
df.head(3)

[Row(id=1, name='geetha', location='chennai', salary=2000, age=20),
 Row(id=2, name='rama', location='hyd', salary=3000, age=19),
 Row(id=3, name='pooja', location='bangolore', salary=1500, age=23)]

select columns

In [26]:
df.select('name').show()

+------+
|  name|
+------+
|geetha|
|  rama|
| pooja|
|   sir|
+------+

In [27]:
df.select(["name","age"]).show()

+------+---+
|  name|age|
+------+---+
|geetha| 20|
|  rama| 19|
| pooja| 23|
|   sir| 25|
+------+---+

In [29]:
df.describe().show()

+-------+------------------+------+---------+-----------------+------------------+
|summary|                id|  name| location|           salary|               age|
+-------+------------------+------+---------+-----------------+------------------+
|  count|                 4|     4|        4|                4|                 4|
|   mean|               2.5|  NULL|     NULL|           2250.0|             21.75|
| stddev|1.2909944487358056|  NULL|     NULL|645.4972243679028|2.7537852736430506|
|    min|                 1|geetha|bangolore|             1500|                19|
|    max|                 4|   sir|      hyd|             3000|                25|
+-------+------------------+------+---------+-----------------+------------------+

In [38]:
#adding columns in dataframe
df.withColumn('age after 2 years',df['age']+2).show()

+---+------+---------+------+---+-----------------+
| id|  name| location|salary|age|age after 2 years|
+---+------+---------+------+---+-----------------+
|  1|geetha|  chennai|  2000| 20|               22|
|  2|  rama|      hyd|  3000| 19|               21|
|  3| pooja|bangolore|  1500| 23|               25|
|  4|   sir|      hyd|  2500| 25|               27|
+---+------+---------+------+---+-----------------+

In [40]:
#drop columns in dataframe
d=df.drop('age after 2 years')

In [41]:
d.show()

+---+------+---------+------+---+
| id|  name| location|salary|age|
+---+------+---------+------+---+
|  1|geetha|  chennai|  2000| 20|
|  2|  rama|      hyd|  3000| 19|
|  3| pooja|bangolore|  1500| 23|
|  4|   sir|      hyd|  2500| 25|
+---+------+---------+------+---+

In [98]:
#rename the columns
df=d.withColumnRenamed("name","Name")

In [100]:
df.sort('age').select('name','salary','age').show()

+------+------+---+
|  name|salary|age|
+------+------+---+
|  rama|  3000| 19|
|geetha|  2000| 20|
|sravya|  3000| 22|
| pooja|  1500| 23|
|   sir|  2500| 25|
+------+------+---+

In [51]:
df=spark.read.csv("C:/Users/HI/OneDrive/Desktop/emp.csv",header=True,inferSchema=True)
df.show()

+---+------+---------+------+----+
| id|  name| location|salary| age|
+---+------+---------+------+----+
|  1|geetha|  chennai|  2000|  20|
|  2|  rama|      hyd|  3000|NULL|
|  3| pooja|bangolore|  NULL|  23|
|  4|   sir|      hyd|  2500|  25|
|  5|sravya|     NULL|  3000|NULL|
+---+------+---------+------+----+

In [52]:
#drop rows having null values
df.na.drop().show()

+---+------+--------+------+---+
| id|  name|location|salary|age|
+---+------+--------+------+---+
|  1|geetha| chennai|  2000| 20|
|  4|   sir|     hyd|  2500| 25|
+---+------+--------+------+---+

In [53]:
df.na.drop(how="any").show()#how=any deletes rows if any of the value is numm

+---+------+--------+------+---+
| id|  name|location|salary|age|
+---+------+--------+------+---+
|  1|geetha| chennai|  2000| 20|
|  4|   sir|     hyd|  2500| 25|
+---+------+--------+------+---+

In [54]:
df.na.drop(how="all").show()#all deletes if all values are null

+---+------+---------+------+----+
| id|  name| location|salary| age|
+---+------+---------+------+----+
|  1|geetha|  chennai|  2000|  20|
|  2|  rama|      hyd|  3000|NULL|
|  3| pooja|bangolore|  NULL|  23|
|  4|   sir|      hyd|  2500|  25|
|  5|sravya|     NULL|  3000|NULL|
+---+------+---------+------+----+

In [59]:
df.na.drop(how="any",thresh=2).show()#threshold=non null values

+---+------+---------+------+----+
| id|  name| location|salary| age|
+---+------+---------+------+----+
|  1|geetha|  chennai|  2000|  20|
|  2|  rama|      hyd|  3000|NULL|
|  3| pooja|bangolore|  NULL|  23|
|  4|   sir|      hyd|  2500|  25|
|  5|sravya|     NULL|  3000|NULL|
+---+------+---------+------+----+

In [60]:
#subset-removes the rows which have null values in the column specified.
df.na.drop(subset=["salary"]).show()

+---+------+--------+------+----+
| id|  name|location|salary| age|
+---+------+--------+------+----+
|  1|geetha| chennai|  2000|  20|
|  2|  rama|     hyd|  3000|NULL|
|  4|   sir|     hyd|  2500|  25|
|  5|sravya|    NULL|  3000|NULL|
+---+------+--------+------+----+

In [64]:
#filling missing values
df.na.fill('city',['location']).show()

+---+------+---------+------+----+
| id|  name| location|salary| age|
+---+------+---------+------+----+
|  1|geetha|  chennai|  2000|  20|
|  2|  rama|      hyd|  3000|NULL|
|  3| pooja|bangolore|  NULL|  23|
|  4|   sir|      hyd|  2500|  25|
|  5|sravya|     city|  3000|NULL|
+---+------+---------+------+----+

In [67]:
#filter operations
df.filter('age>21').show()

+---+------+---------+------+---+
| id|  name| location|salary|age|
+---+------+---------+------+---+
|  3| pooja|bangolore|  1500| 23|
|  4|   sir|      hyd|  2500| 25|
|  5|sravya|      kou|  3000| 22|
+---+------+---------+------+---+

In [70]:
df.filter((df['salary']>=2500) & 
         (df['age']>20)).show()

+---+------+--------+------+---+
| id|  name|location|salary|age|
+---+------+--------+------+---+
|  4|   sir|     hyd|  2500| 25|
|  5|sravya|     kou|  3000| 22|
+---+------+--------+------+---+

In [79]:
b=spark.sparkContext.parallelize([1,2,3,4,5,6,7,8,9])

In [84]:
b

ParallelCollectionRDD[186] at readRDDFromFile at PythonRDD.scala:289

In [102]:
df=spark.read.csv("C:/Users/HI/OneDrive/Desktop/Book1.csv",header=True,inferSchema=True)
df.show()

+---------+------------+--------------------+
|     name|  department|              salary|
+---------+------------+--------------------+
|    Krish|Data Science|               10000|
|    Krish|         IOT|                5000|
|   Mahesh|    Big Data|                4000|
|    Krish|    Big Data|                4000|
|   Mahesh|Data Science|                3000|
|Sudhanshu|Data Science|               20000|
|Sudhanshu|         IOT|               10000|
|Sudhanshu|    Big Data|                5000|
|    Sunny|Data Science|               10000|
|    Sunny|    Big Data|                2000|
+---------+------------+--------------------+

In [106]:
#groupby
df.groupBy('name').sum().show()

+---------+-------------------------+
|     name|sum(              salary)|
+---------+-------------------------+
|Sudhanshu|                    35000|
|    Sunny|                    12000|
|    Krish|                    19000|
|   Mahesh|                     7000|
+---------+-------------------------+

In [109]:
#groupby departments
df.groupBy('department').count().show()

+------------+-----+
|  department|count|
+------------+-----+
|         IOT|    2|
|    Big Data|    4|
|Data Science|    4|
+------------+-----+